Revit 2024 API
RebarUpdateCurvesData.AreOrientationOptionsChanged Property
 Indicates if the orientation options have changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool AreOrientationOptionsChanged { get; }
Visual Basic
Public ReadOnly Property AreOrientationOptionsChanged As Boolean
	Get
Visual C++
public:
property bool AreOrientationOptionsChanged {
	bool get ();
}
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace